
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8672126447)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
google_project_service.vision_api: Refreshing state... [id=lgtmgen-project/vision.googleapis.com]
google_project_service.firestore_api: Refreshing state... [id=lgtmgen-project/firestore.googleapis.com]
google_artifact_registry_repository.main-repo: Refreshing state... [id=projects/lgtmgen-project/locations/asia-northeast1/repositories/dev-main]
google_firestore_database.datastore_mode_database: Refreshing state... [id=projects/lgtmgen-project/databases/(default)]
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.cloudrun-dev-main-backend will be created
  + resource "google_cloud_run_service" "cloudrun-dev-main-backend" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "dev-main-backend"
      + project                    = "lgtmgen-project"
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/backend"
                  + name  = (known after apply)
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_cloud_run_service.cloudrun-dev-main-backend: Creating...
google_storage_bucket.public_image_bucket: Modifications complete after 1s [id=lgtm-public-image-bucket]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [10s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [20s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [30s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [40s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [50s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [1m0s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [1m10s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [1m20s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [1m30s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [1m40s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [1m50s elapsed]
google_cloud_run_service.cloudrun-dev-main-backend: Still creating... [2m0s elapsed]
╷
│ Error: Error waiting to create Service: resource is in failed state "Ready:False", message: Revision 'dev-main-backend-00001-8sg' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
│ 
│ Logs URL: https://console.cloud.google.com/logs/viewer?project=lgtmgen-project&resource=cloud_run_revision/service_name/dev-main-backend/revision_name/dev-main-backend-00001-8sg&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22dev-main-backend%22%0Aresource.labels.revision_name%3D%22dev-main-backend-00001-8sg%22 
│ For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
│ 
│   with google_cloud_run_service.cloudrun-dev-main-backend,
│   on cloudrun.tf line 1, in resource "google_cloud_run_service" "cloudrun-dev-main-backend":
│    1: resource "google_cloud_run_service" "cloudrun-dev-main-backend" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":10,"Program":"tfcmt","SHA1":"b61f55c3a7efff91ff33ab85b15baa258801dd38","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->